app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "yeah it is - so awesome"], ["created_at", Mon, 27 May 2013 10:26:16 UTC +00:00], ["post_id", 1], ["updated_at", Mon, 27 May 2013 10:26:16 UTC +00:00]]
---
  def create
                @post = Post.find(params[:post_id])
                @comment = @post.comments.create!(params[:comment])