app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "is totally awesome!!"], ["created_at", Mon, 27 May 2013 10:08:37 UTC +00:00], ["title", "first post"], ["updated_at", Mon, 27 May 2013 10:08:37 UTC +00:00]]